
examples = \
[

# 2/23
"""
```
发型师：你好 请问我叫yogi今天我来帮你设计发型
顾客：好的 
发型师：因为是第一次接触，所以我想线听听您自己的想法
顾客：我想剪短发，好打理一点 （注解：顾客的要求是 剪短发和好打理 从实际出发 剪短发和好打理这两个要求其实是有点冲突的 因为短发会因为睡觉变形 导致发型可能睡醒不理想 所以出门前有一定概率需要把头发部分或全部打湿或者洗一下重新整理一下 而长发中长发则不易受到睡觉的影响 起床即使很乱 也可以用皮筋把头发扎起来 所以如果扎起来也算对头发的一种打理的话 对于日常打理其实中长发比短发要好打理 那么这个时候顾客描述好打理 可能是特指某种情况下的好打理 这个需要发型师更深入的提问才能知晓顾客真实意图
发型师：为什么想剪短呢？
顾客：吹头发太累了（这个时候顾客的真实意图显现出来 是因为吹头发时候的负担 让顾客觉得长头发打理起来太费劲 或者是耗时太久 那么剪短确实是可以解决吹头发累这个困扰 但要注意的是 并非只有剪短这一种选择来改善这个问题 所以是否精准解决顾客困扰非常考验发型师的提问水平） 然后也没尝试过短发 想清爽一点干净一点（这里面透露了一个信息就是 顾客希望清爽一点干净一点 那么通常这种情况表示她觉得目前的头发不清爽 不干净）
发型师：嗯，是的，目前这长度平时吹风洗发都会比较累一点，如果剪短相对会轻松一些 吹头发也会节省不少时间，不过要注意的是相比长发 短发在一觉睡醒后可能会有后脑勺被压翘压变形的问题，所以如果你不是早上洗头的话可能每天出门前如果发型有点乱的话需要你简单的整理一下
顾客：我是晚上洗头的，那要怎么整理呢？需要花很多时间吗？
发型师：那倒不会 因为你刚剪短 我会修剪一款不容易睡觉被压乱的发型给到你 如果有些许蓬乱翘的话 只需要你把不理想的位置打湿 再自然吹干就行了
顾客：听起来不是很难 我觉得可以
发型师：方便问一下您是从事什么职业的吗？
顾客：我在律师事务所工作
发型师：基于您的工作形式 我觉得给您设计一款长度至下巴，轮廓略显饱满，两侧略微收紧，干练可靠的短发造型您觉的怎么样，我感觉比较符合您的实际情况 
顾客：很好 我也是这么想的，就是要好打理就可以了
发型师：那我们开始吧
以上是相对比较常规的也比较简单的沟通设计对话 没有涉及到过多发色以及发型细节 
```
""",

# 2/25

"""
```发型师：你好
顾客：你好 
发型师：今天关于头发 请问有什么想法吗
顾客：你好，我今天想改变一下，想看上去年轻一点
发型师：好的，我明白了，我们目前头发的长度是在肩膀靠下一点的位置，对于这样的长度你打算继续留长吗？
顾客：我也不知道，之前是短发留长的，你觉得怎样比较好
发型师：我觉得是这样的 我们目前的长度属于过肩中发，如果略微修掉一点的话，头发的长度会在肩上到颈部的区间，这个长度很容易睡醒会翘，不是那么好打理，所以要考虑好打理的话我的建议要么就是剪到下巴左右的位置，要么就是尽量不改变长度
顾客：我都可以其实，你看怎样比较好
发型师：好的 在判断怎样比较好之前，我先问几个问题
顾客：你问：
发型师：今天考虑剪个刘海吗？
顾客：我之前剪过刘海，但感觉不太好打理
发型师：是这样的，如果我们想要概念一下，看上去年轻一些的话，那么刘海可以改变最小换最大效果，所以当顾客有年轻一点的要求，我会优先建议客人选择刘海，然后我看了一下你的脸型以及发根的流向，只要刘海的长度适当的话，我有信心不会难打理，平时你只要吹吹干就可以了
顾客：那是怎样的刘海呢？
发型师：首先刘海的第一要素是你回家能够再现，要好打理，所以刘海的量我们不会分布的很多，具体量是能隐约看见额头的量感，刘海的宽度设定跟随你的自然流向来梳理，只把修剪外眼角延长线宽度的头发作为刘海，从外眼角延长线至额角修剪到唇下延长线的位置来修饰脸型，刘海的长度设定在不遮住眼睛与眉毛之间 这样不会遮挡视线又有亮眼的效果，刘海不会剪的很齐很齐，而是把刘海的末端修剪成自然羽状的效果
顾客：听上去很不错，但我真的很担心不好打理
发型师：这个你不用担心，请问你是早上洗头还是晚上洗头？
顾客：我是晚上洗的
发型师：没问题，晚上洗头 一觉睡醒刘海会乱是很正常的，我们要确保的是晚上洗完头，把刘海往下吹，让刘海的根部不要分开，不要湿着刘海让她自然干，早上睡醒即使有些乱，只需要用化妆棉沾点水把刘海的根据湿润一下，再用吹风机吹干即可，整个过程一分钟内就可以完成了 
顾客：吹刘海有什么技巧吗？
发型师：其实没什么技巧，只要往下吹就可以了，不过你放心，过会剪完头发吹干的时候我会手把手教你，非常简单。
顾客：好的，那就剪个刘海试试吧
发型师：那就这么决定了，基于我们的要求是改变一下 显的年轻一些，那么我觉得一个完美的刘海就可以处理好我们的要求了，所以长度以及厚度我不建议做太大改动，第一是因为剪短一些的话会导致头发再肩膀位置乱翘不好打理，第二如果剪太多 改变太大同时风险也大，如果能达到要求的话保守处理，可以把大幅度的改变留到下次我们更加熟悉的时候，这样成功率就会大大提高，第三保留长度也是为了留更长做准备，如果头发足够长，那么我们下次改变的空间也会更大一些
顾客：我相信你，就交给你吧
```""",

]

print(len(examples))



examples_selected = [
    """
发型师：你好
顾客：你好
发型师：今天关于发型有什么想法吗？
顾客：我今天想修一下然后我想烫一下发根，因为我觉的头顶太瘪了
发型师：好的 ，因为我们的头顶不够蓬松，所以想通过烫一下发根来解决头顶塌的问题对吗？
顾客：是的
发型师：好的，那请问你之前有做过类似的发根蓬松烫发吗？
顾客：没有做过，我看网上小红书里面都在发这个，所以我想试一下
发型师：好的，我明白了，我跟您简单介绍一下，您想尝试的这个发根烫，的确是可以解决发根瘪塌的问题，但有几点需要跟您说明一下
顾客：好的，你说
发型师：首先发根烫可以作为发根蓬松的一个辅助作用，即使我们烫了发根烫，在洗完头发我们依然需要在洗完头吹干的过程中加以注意，才能达到比较好的蓬松效果，然后当我们一觉睡醒蓬松的效果也有可能因为我们睡觉被压的变形，这种情况就需要我们把发根打湿让她恢复到原本的效果，在简单吹一下让它恢复蓬松，然后即使我们烫了发根烫 但如果顶上的头发太长太重的话，由于重量的原因发根依旧会撑不起来，所以针对顶上的头发我们也需要进行适当的修剪以及去除一些重量来达到最好的蓬松效果，调整的量越多蓬松的效果就越好
顾客：那会要剪掉很多头发吗？
发型师：这点你可以放心，因为主要营造蓬松感的头发分布在我们眼尾以上的头顶区域，我们可以先适当的修剪掉一些，看一下效果，如果我们一致认为可以在剪掉一些，我们在一点点的修剪，这样可以保证修剪掉的头发在您的可接受范围
顾客：好的，那我们试试吧
发型师：好的
发型师：那我们开始吧
"""
]
