customer_list = [

  {
    "姓名": "赵雨晴",
    "性别": "女",
    "年龄": 28,
    "职业": "时尚杂志编辑",
    "发质": "细软，直发",
    "发色": "深棕色，金色挑染",
    "发型需求-改变程度": "需要大幅度的改变个人风格，从商务改变成为时尚",
    "发型需求": "波浪卷发，追求时尚潮流",
    "生活方式": "注重个人形象，经常社交活动，需适应不同场合",
    "个性": "开朗外向，喜欢交流，对时尚趋势敏感",
    "特别要求": "染发烫发减少损伤，使用天然成分护发产品"
  },

  {
    "姓名": "李思思",
    "性别": "女",
    "年龄": 22,
    "职业": "大学生",
    "发质": "柔软，波浪卷",
    "发色": "浅棕色",
    "发型需求": "可爱风格，多变发型",
    "生活方式": "校园生活，参加社团活动",
    "个性": "活泼，喜欢尝试新鲜事物",
    "特别要求": "经济实惠，发型可爱"
  },

  {
    "姓名": "周莉莉",
    "性别": "女",
    "年龄": 30,
    "职业": "律师",
    "发质": "硬直",
    "发色": "黑色",
    "发型需求": "专业正式，低马尾或盘发",
    "生活方式": "工作正式，需要专业形象",
    "个性": "严谨，专业，喜欢简洁",
    "特别要求": "发型专业，快速完成"
  },

  {
    "姓名": "陈晨",
    "性别": "女",
    "年龄": 35,
    "职业": "医生",
    "发质": "中等，直发",
    "发色": "黑色",
    "发型需求": "干净利落，便于佩戴医帽",
    "生活方式": "工作繁忙，需长时间佩戴医帽",
    "个性": "专注，有责任感",
    "特别要求": "发型利落，不影响佩戴医帽"
  },
  {
    "姓名": "林涛",
    "性别": "男",
    "年龄": 40,
    "职业": "建筑师",
    "发质": "硬，直发",
    "发色": "黑色",
    "发型需求": "经典短发，体现专业形象",
    "生活方式": "工作环境正式，需展现专业形象",
    "个性": "创新，注重形象",
    "特别要求": "发型经典，体现专业"
  },
  {
    "姓名": "黄蓉",
    "性别": "女",
    "年龄": 25,
    "职业": "艺术设计师",
    "发质": "柔软，波浪卷",
    "发色": "红色",
    "发型需求": "创意发型，体现个性",
    "生活方式": "追求个性，喜欢尝试不同风格",
    "个性": "创意，独立，喜欢表达自我",
    "特别要求": "发型创意，体现个性"
  },
  {
    "姓名": "徐强",
    "性别": "男",
    "年龄": 33,
    "职业": "健身教练",
    "发质": "粗硬，短发",
    "发色": "黑色",
    "发型需求": "短发，运动风格",
    "生活方式": "热爱运动，工作时需佩戴头带",
    "个性": "活力，热情，注重健康",
    "特别要求": "发型短，适合运动"
  },
  {
    "姓名": "孙悦",
    "性别": "女",
    "年龄": 29,
    "职业": "营销经理",
    "发质": "中等，直发",
    "发色": "深棕色",
    "发型需求": "时尚中长发，便于变换造型",
    "生活方式": "工作需要应对多种场合，需多变发型",
    "个性": "灵活，善于沟通，追求时尚",
    "特别要求": "发型时尚，易于变换"
  }
]