
examples_selected = [
    """
发型师：你好
顾客：你好
发型师：今天关于发型有什么想法吗？
顾客：我今天想修一下然后我想烫一下发根，因为我觉的头顶太瘪了
发型师：好的 ，因为我们的头顶不够蓬松，所以想通过烫一下发根来解决头顶塌的问题对吗？
顾客：是的
发型师：好的，那请问你之前有做过类似的发根蓬松烫发吗？
顾客：没有做过，我看网上小红书里面都在发这个，所以我想试一下
发型师：好的，我明白了，我跟您简单介绍一下，您想尝试的这个发根烫，的确是可以解决发根瘪塌的问题，但有几点需要跟您说明一下
顾客：好的，你说
发型师：首先发根烫可以作为发根蓬松的一个辅助作用，即使我们烫了发根烫，在洗完头发我们依然需要在洗完头吹干的过程中加以注意，才能达到比较好的蓬松效果，然后当我们一觉睡醒蓬松的效果也有可能因为我们睡觉被压的变形，这种情况就需要我们把发根打湿让她恢复到原本的效果，在简单吹一下让它恢复蓬松，然后即使我们烫了发根烫 但如果顶上的头发太长太重的话，由于重量的原因发根依旧会撑不起来，所以针对顶上的头发我们也需要进行适当的修剪以及去除一些重量来达到最好的蓬松效果，调整的量越多蓬松的效果就越好
顾客：那会要剪掉很多头发吗？
发型师：这点你可以放心，因为主要营造蓬松感的头发分布在我们眼尾以上的头顶区域，我们可以先适当的修剪掉一些，看一下效果，如果我们一致认为可以在剪掉一些，我们在一点点的修剪，这样可以保证修剪掉的头发在您的可接受范围
顾客：好的，那我们试试吧
发型师：好的
发型师：那我们开始吧
"""
]

examples = \
["""
发型师：你好
顾客：你好
发型师：今天关于发型有什么想法吗？
顾客：我今天想修一下然后我想烫一下发根，因为我觉的头顶太瘪了
发型师：好的 ，因为我们的头顶不够蓬松，所以想通过烫一下发根来解决头顶塌的问题对吗？
顾客：是的
发型师：好的，那请问你之前有做过类似的发根蓬松烫发吗？
顾客：没有做过，我看网上小红书里面都在发这个，所以我想试一下
发型师：好的，我明白了，我跟您简单介绍一下，您想尝试的这个发根烫，的确是可以解决发根瘪塌的问题，但有几点需要跟您说明一下
顾客：好的，你说
发型师：首先发根烫可以作为发根蓬松的一个辅助作用，即使我们烫了发根烫，在洗完头发我们依然需要在洗完头吹干的过程中加以注意，才能达到比较好的蓬松效果，然后当我们一觉睡醒蓬松的效果也有可能因为我们睡觉被压的变形，这种情况就需要我们把发根打湿让她恢复到原本的效果，在简单吹一下让它恢复蓬松，然后即使我们烫了发根烫 但如果顶上的头发太长太重的话，由于重量的原因发根依旧会撑不起来，所以针对顶上的头发我们也需要进行适当的修剪以及去除一些重量来达到最好的蓬松效果，调整的量越多蓬松的效果就越好
顾客：那会要剪掉很多头发吗？
发型师：这点你可以放心，因为主要营造蓬松感的头发分布在我们眼尾以上的头顶区域，我们可以先适当的修剪掉一些，看一下效果，如果我们一致认为可以在剪掉一些，我们在一点点的修剪，这样可以保证修剪掉的头发在您的可接受范围
顾客：好的，那我们试试吧
发型师：没问题，最后需要和您强调一下，发根烫的维持时间，因为我们的头发是会向外生长的，所以每隔一段时间烫过的位置就会离发根越远，所以正常来说 一个月后发根蓬松的效果就会不如从前，这点需要和您说明一下，因为维持的时间偏短
顾客：那一个月后怎么办？
发型师：不用担心，一个月后它的效果只是不如一个月前那么好，但还是会比你没有烫过的头顶要蓬松的，或者一个月后我们可以继续烫一下
顾客：好的，那么试一下吧
发型师：没问题，另外 刚才您说想修一下，我想问一下您打算留长吗？
顾客：没有特别想留长，但也不想剪太多
发型师：所以今天整体的长度并不想有太大变化，想修一下的原因是觉得发尾有些受损，把不好的地方剪掉，还是觉得发尾的头发有点不太整齐，想修的整齐一些呢？
顾客：都有一点吧，发尾我感觉有点分叉，有些时候打理有点翘
发型师：明白，发尾分叉的部分我们修掉一些，尽量不改变太多的长度，发尾翘的话通常来说是因为发尾的发量不够，导致分量太轻，如果能把发尾的头发修剪的整齐一些，看上去不那么稀疏，就能增加发尾的重量，使其变的更有质感更好打理
顾客：好的那就这么做吧
发型师：没问题，我们现在对于发型，长度确定了，轮廓也已经确定了，我还有两点需要了解一下，以便我更好的做设计可以吗
顾客：还有什么要确认的吗？
发型师：是的，对于脸周围的头发您有什么想法以及要求吗？
顾客：脸周围的头发你指的是刘海吗？我不想剪刘海
发型师：您不想剪刘海没问题，我已经明白了，我说的脸周围的头发并不是要给您剪刘海的意思，因为脸周围的头发和我们头顶蓬松的头发是连在一起的，所以蓬松的效果怎么样，脸周围头发的长度也起到关键的作用，如果脸周围的头发越短蓬松的效果就越好，脸周围的头发越长，蓬松就会变的越难？
顾客：会要剪很短吗？我平时扎起来和工作的时候会不会不方便？
发型师：你平时低头工作多吗？
顾客：那到还好
发型师：如果你平时低头工作不多的话，我觉得剪短一些事不会对工作有什么影响的，我们可以吧刘海剪到又能修饰脸型又正好能夹在耳朵后面的长度，这样你扎起来或者低头走事情都不会对你构成不便，如果平日把头发扎起来，其实脸周围留一些头发修饰脸型，会更好看呢？
顾客：只要不剪刘海就行，我们试试吧
发型师：好的，另外你觉的自己头发厚吗？
顾客：我觉得不厚，我还觉的自己有点掉发
发型师：好的，明白了，是这样的，我们平时观察自己的头发大多数只能观察到正面，大多观察不到后面的头发，我们前面的头发确实发量挺正常的，但是我们后部的头发其实是有点多的，后面头发多的话会让头发的重量增加，头发重量增加了 头发就会容易下沉，显的质感好，但动感不足，所以我的建议可以适当把我们后头部的发量进行一些调整，来增加动感从而达到整体蓬松的效果
顾客：那会打薄很多吗？
发型师：我们可以先尝试少量的调整，先看一下前后对比，然后再决定是不是再去掉一些，就和我们的头顶蓬松的修剪一样，一点一点地修剪来确保最后是你觉得最理想的效果
顾客：好的，那就这么决定了（这个是发型师思考的比较周全切保险的沟通设计方案 如果按照这个流程 技术上没有瑕疵的话 顾客的满意度将会变得很高 顾客会觉得有很多附加值）
""",

# 2/23
"""
发型师：你好 请问我叫yogi今天我来帮你设计发型
顾客：好的 
发型师：因为是第一次接触，所以我想线听听您自己的想法
顾客：我想剪短发，好打理一点 （注解：顾客的要求是 剪短发和好打理 从实际出发 剪短发和好打理这两个要求其实是有点冲突的 因为短发会因为睡觉变形 导致发型可能睡醒不理想 所以出门前有一定概率需要把头发部分或全部打湿或者洗一下重新整理一下 而长发中长发则不易受到睡觉的影响 起床即使很乱 也可以用皮筋把头发扎起来 所以如果扎起来也算对头发的一种打理的话 对于日常打理其实中长发比短发要好打理 那么这个时候顾客描述好打理 可能是特指某种情况下的好打理 这个需要发型师更深入的提问才能知晓顾客真实意图
发型师：为什么想剪短呢？
顾客：吹头发太累了（这个时候顾客的真实意图显现出来 是因为吹头发时候的负担 让顾客觉得长头发打理起来太费劲 或者是耗时太久 那么剪短确实是可以解决吹头发累这个困扰 但要注意的是 并非只有剪短这一种选择来改善这个问题 所以是否精准解决顾客困扰非常考验发型师的提问水平） 然后也没尝试过短发 想清爽一点干净一点（这里面透露了一个信息就是 顾客希望清爽一点干净一点 那么通常这种情况表示她觉得目前的头发不清爽 不干净）
发型师：嗯，是的，目前这长度平时吹风洗发都会比较累一点，如果剪短相对会轻松一些 吹头发也会节省不少时间，不过要注意的是相比长发 短发在一觉睡醒后可能会有后脑勺被压翘压变形的问题，所以如果你不是早上洗头的话可能每天出门前如果发型有点乱的话需要你简单的整理一下
顾客：我是晚上洗头的，那要怎么整理呢？需要花很多时间吗？
发型师：那倒不会 因为你刚剪短 我会修剪一款不容易睡觉被压乱的发型给到你 如果有些许蓬乱翘的话 只需要你把不理想的位置打湿 再自然吹干就行了
顾客：听起来不是很难 我觉得可以
发型师：方便问一下您是从事什么职业的吗？
顾客：我在律师事务所工作
发型师：基于您的工作形式 我觉得给您设计一款长度至下巴，轮廓略显饱满，两侧略微收紧，干练可靠的短发造型您觉的怎么样，我感觉比较符合您的实际情况 
顾客：很好 我也是这么想的，就是要好打理就可以了
发型师：那我们开始吧
以上是相对比较常规的也比较简单的沟通设计对话 没有涉及到过多发色以及发型细节 
""",

# 2/25

"""发型师：你好
顾客：你好 
发型师：今天关于头发 请问有什么想法吗
顾客：你好，我今天想改变一下，想看上去年轻一点
发型师：好的，我明白了，我们目前头发的长度是在肩膀靠下一点的位置，对于这样的长度你打算继续留长吗？
顾客：我也不知道，之前是短发留长的，你觉得怎样比较好
发型师：我觉得是这样的 我们目前的长度属于过肩中发，如果略微修掉一点的话，头发的长度会在肩上到颈部的区间，这个长度很容易睡醒会翘，不是那么好打理，所以要考虑好打理的话我的建议要么就是剪到下巴左右的位置，要么就是尽量不改变长度
顾客：我都可以其实，你看怎样比较好
发型师：好的 在判断怎样比较好之前，我先问几个问题
顾客：你问：
发型师：今天考虑剪个刘海吗？
顾客：我之前剪过刘海，但感觉不太好打理
发型师：是这样的，如果我们想要概念一下，看上去年轻一些的话，那么刘海可以改变最小换最大效果，所以当顾客有年轻一点的要求，我会优先建议客人选择刘海，然后我看了一下你的脸型以及发根的流向，只要刘海的长度适当的话，我有信心不会难打理，平时你只要吹吹干就可以了
顾客：那是怎样的刘海呢？
发型师：首先刘海的第一要素是你回家能够再现，要好打理，所以刘海的量我们不会分布的很多，具体量是能隐约看见额头的量感，刘海的宽度设定跟随你的自然流向来梳理，只把修剪外眼角延长线宽度的头发作为刘海，从外眼角延长线至额角修剪到唇下延长线的位置来修饰脸型，刘海的长度设定在不遮住眼睛与眉毛之间 这样不会遮挡视线又有亮眼的效果，刘海不会剪的很齐很齐，而是把刘海的末端修剪成自然羽状的效果
顾客：听上去很不错，但我真的很担心不好打理
发型师：这个你不用担心，请问你是早上洗头还是晚上洗头？
顾客：我是晚上洗的
发型师：没问题，晚上洗头 一觉睡醒刘海会乱是很正常的，我们要确保的是晚上洗完头，把刘海往下吹，让刘海的根部不要分开，不要湿着刘海让她自然干，早上睡醒即使有些乱，只需要用化妆棉沾点水把刘海的根据湿润一下，再用吹风机吹干即可，整个过程一分钟内就可以完成了 
顾客：吹刘海有什么技巧吗？
发型师：其实没什么技巧，只要往下吹就可以了，不过你放心，过会剪完头发吹干的时候我会手把手教你，非常简单。
顾客：好的，那就剪个刘海试试吧
发型师：那就这么决定了，基于我们的要求是改变一下 显的年轻一些，那么我觉得一个完美的刘海就可以处理好我们的要求了，所以长度以及厚度我不建议做太大改动，第一是因为剪短一些的话会导致头发再肩膀位置乱翘不好打理，第二如果剪太多 改变太大同时风险也大，如果能达到要求的话保守处理，可以把大幅度的改变留到下次我们更加熟悉的时候，这样成功率就会大大提高，第三保留长度也是为了留更长做准备，如果头发足够长，那么我们下次改变的空间也会更大一些
顾客：我相信你，就交给你吧""",




"""
发型师：你好
顾客：你好
发型师：我是yogi，今天是想染一下头发？
顾客：对的，很久没染头发了
发型师：好的，我看您头发长出来10厘米左右，大概有一年半没染了，是什么原因那么久没染呢？（要询问顾客染发的频率，因为如果顾客染发频率过低 染发间隔时间过久的话 那么太浅的颜色会因为新生的黑发长出来导致头发出现黑发和浅发两种颜色的情况，这种情况不太好看，也缺乏质感，在设计上考虑顾客染发周期来给顾客挑选颜色也是很重要的）
顾客：生小孩
发型师：嗯，明白了，所以这次才会这么久没染头发
顾客：对的，已经期待很久了
发型师：您自己有想染的发色嘛
顾客：嗯……不要太深，不要发橘，特别不要一点点偏红
发型师：好的，方便看一下您手腕嘛！
顾客：为啥！
发型师：通过手腕上静脉呈现的颜色判断您肤色适合的发色（如果手腕内部的静脉颜色呈现粉色 那么肤色就是冷白肤色 如果静脉呈现青色 就是暖黄肤色 如果粉色 青色都有 就是中性肤色）
顾客：这么神奇
发型师：您确实不太适合偏红的发色，相反带一点亚麻或者冷茶色的发色更适合您的肤色
顾客：对对对，我之前基本都是冷色系的
发型师：然后现在头发上的颜色是不是生孩子前染深了又褪出来的颜色
顾客：对的
发型师：那现在这个发色对于您来说是偏深还是偏浅或者正正好呢
顾客：有点深的
发型师：你平时染发的周期大约多久染一次呢？
顾客：平时一般3个月染一次
发型师：我明白了 如果三个月染一次的话 我们染发的明度不能太浅 不然黑头发长出来就有点尴尬
顾客：好的，我也不想太频繁的染发 
发型师：好的，我明白了，今天头发要修剪嘛
顾客：今天就先染一下，想留长，先不剪了
发型师：好的，那我跟您确认一下发色，根据你的要求 这次染发的明度控制在比之前浅一些 差不多9级色阶 然后有灰棕色和青棕色供您选择 您看可以嘛
顾客：我觉的9级的青棕色 这个不错
发型师：好的，那我先让助理染发前准备一下，我去调配染发颜色啦 """,


# 2/28
"""发型师 你好我是Andy 您今天有什么想法可以和我说
客人：没有什么想法
发型师：没什么想法的话我来帮您看下
平时对头发有什么困扰吗？
客人：有时候刘海容易分开来变成一条一条
发型师：刘海容易变得一束一束的
客人：对的，我后面有个很大的旋
发型师：我看到了后脑勺的头发容易分开来，因为有个旋
后面的头发分开了就会容易显得头顶扁，头发跑到两边就会显得两边宽
我们不需要头，两边那么宽，两边过宽比例时就失调了
我们修剪方面可以让两边稍稍的往里收一点也不用太过于收
我们的头顶是分开来的，头顶分开来的容易看起来头顶平两边宽，所以我们把分开的位置剪得蓬松一些，两边剪的收一点点、比例看起来就会好
顾客：好的
发型师：平时我们会觉得头发会有点厚吗？
顾客：会有一点点厚
发型师：我也觉得有一点 我们平时会戴眼镜吗？如果戴眼镜的话，我们就可以把耳朵露出来一点点 这样看起来会比较利落
发型师：我们平时工作的时候是需要利落一点的感觉吗？
顾客：对的 有时候需要
发型师：因为我看你今天穿的是有点休闲偏商务的西装
发型师：那我们剪的干练一些是比较适合的
我们的刘海可以再修短一些些，这样我们的自然卷看起来不会那么乱，正好剪到自然卷一圈的位置，这样的长度是比较好打理的
过会儿洗完之后我再帮您看一下
顾客：听上去不错
发型师：所以我们今天的话是两侧的位置剪得稍微往里收一点，让他不要那么厚重的同时头顶的头发剪一些层次，让颅顶看起来蓬松一些
这样你觉得可以吗？
顾客：好的
那我们就开始洗头发吧
""",

"""顾客 我想剪短
发型师 想剪短是吗
顾客：因为我原来是公主切（公主切指脸颊两侧或水平或前低后高的整齐的齐面吧脸颊两侧的刘海剪短至颧骨与下巴区间的一种和其他部分头发不关联的设计感造型） 但是我的公主切原来太长了，因为疫情原因一直留着，现在太长了，我大概想要其肩的长度 最长的部分，就其肩差不多，我的脸型有点方，我也不染不烫，你有什么建议，我下面以前染过，今天可以把之前染过的剪掉吗？ 
发型师：我看你染后长出来挺多的 
顾客：对 我就是不想染了
发型师：我看长度差不多有半年了
顾客：对 所以看看这次能不能剪掉
发型师：我们一般来说一个月头发生长速度大约在一厘米左右 现在半年过去了长出来大概6厘米一点 所以一下子剪完可能有些困难  
顾客：那能剪掉多少算多少吧
发型师：之前剪公主切 剪完什么感觉
顾客：就是我还觉得蛮好玩的
现在稍微剪点层次也可以 就是我不喜欢太碎 因为我头发其实也不是很多 
发型师：平时是早上洗头 还是晚上洗头
顾客：都有 要看早上运动还是晚上运动
发型师：洗完都一般就是简单吹吹干
顾客：对 但是我有直板夹
发型师：有直板夹对吧 公主切是要直板夹带一下比较好（带一下就是简单快速的使用一下）
今天我们剪到齐肩的长度是没问题的，不过在你居家打理的时候会有要注意的地方，就是当你把后方的头发向前拨弄的时候 肩膀这边会有点翘，如果不想有翘的话 要么平时使用一下夹板 要么我们把长度放长一些 （头发乱翘是很多顾客不喜欢的，所以要告知）
顾客：不是很介意 我平时夹的时候我还会刻意往外夹
发型师：然后 我们不喜欢太碎的话 我们就不能做太多的层次 因为我们的发量不是很多 如果把一部分头发剪短制造层次的话 那下面的发量就变少 从而容易变碎  另外我们有公主切 也会因为这个原因 下区的发量也会变少 我建议把公主切也调整一下 之前公主切是比较齐的 这样对比的话 会显的我们发尾比较轻薄 如果把公主切的发尾调整成尖锥状 反而容易显的我们发尾比较整齐 
顾客：好的 我觉得可以
发型师：然后上面剪的时候就利用之前已经做过层次的头发进行调整 不在拿去过多的头发做层次了
顾客：好的
发型师：那我们去洗头
"""
]

print(len(examples))